Revit 2027 API
BuiltInFailures.ViewPositionFailures.ViewAnchorDoesNotSupportView Property
 The View Anchor ""%1!s!"" is not supported by view ""%2!s!"".
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewAnchorDoesNotSupportView { get; }
Public Shared ReadOnly Property ViewAnchorDoesNotSupportView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewAnchorDoesNotSupportView {
	FailureDefinitionId^ get ();
}
static member ViewAnchorDoesNotSupportView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewPositionFailures Class
Autodesk.Revit.DB Namespace